{
  "breakpointsGrouped": "Defines the upper breakpoints (in pixel) for different screen dimensions.",
  "testInteger1": "Define the maximum width of the image.",
  "testInteger2": "Define something in a string-input-field that we internally store as integer.",
  "testString1": "Enter the id of your cookie-bot (for example: abcdf-acd-dddd-ddd-d3ds23).",
  "testString2": "Enter any amount you like in a number-input-field that we internally store as string.",
  "testBoolean1": "If active the search icon is displayed in the navigation.",
  "testBoolean2": "If active the language-picker-dropdown is displayed in the navigation.",
  "hasALabel1": "This is an example label for this input field.",
  "withoutFields": "Test: grouped-values without defined fields, with default values with different keys.",

  "FIELDS-ABOVE-ARE-FOR-TESTING-ONLY": "FIELDS-ABOVE-ARE-FOR-TESTING-ONLY",

  "breakpoints": "Defines the upper breakpoints (in pixel) for different screen dimensions.",
  "fontSize": "Defines the font-size (in pixel).",
  "fontWeight": "Defines the font-weight (200, 400, 600, 800) of the elements font.",
  "navLogoHeight": "Defines the height of the navigation logo in px. The value 0 will create an image with the larger side being 50px and the smaller side calculated to match the aspect ratio.",
  "marginRichText": "Defines the vertical margin inside of richtext.",
  "additionalCss": "Defines CSS that is applied in addition to the configuration.",
  "additionalCssHover": "Defines CSS that is applied in addition to the configuration when the element gets hovered.",
  "buttonWidth": "Defines the minimum and maximum width of the button.",
  "searchEnabled": "Enables or disables the search.",
  "navSearchIconColor": "Select the color of the search-icon in the navigation.",
  "navSearchIconRight": "Displays the search-icon in the navigation on the right or left side.",
  "searchBarBgColor": "Select the background-color of the searchbar in the navigation.",
  "searchBarFontColor": "Select the color of the font in the searchbar.",
  "searchBarSearchIconColor": "Select the color of the search-icon in the searchbar.",
  "searchBarCloseIconColor": "Select the color of the close-icon in the searchbar.",
  "searchBarMaxWidth": "Defines the maximum width of the searchbar. The value '0' disables the maximum width.",
  "languageSwitchEnabled": "Toggle the language-switch in the navigation. The following color settings define the styling of the language-switch.",
  "strname": "Provide a short meaningful name for your setting.",
  "htmlElement": "Select the appropriate HTML-Element for your typography. Your typography will be the default-style for the selected HTML-Element.",
  "spaceX": "The horicontal (left & right) distance of the element to its container (inner padding).",
  "spaceY": "The vertical (top & bottom) distance of the element to its container (inner padding).",
  "fontName": "Defines the name of the uploaded font-file (.ttf only!). Spaces are not allowed.",
  "googleFontCssImport": "Paste the content of the @import-Input here. You'll find the @import-Input in the sidebar of google fonts (section: use on the web).",
  "recaptchav2publickey": "Enter the google recaptcha v2 public key.",
  "bgColors": "Select the colors that can be used as background-color for the content-element.",
  "bgColorsTitle": "Select the colors that can be used as background-color for the title of the content-element.",
  "bgColorsPanel": "Select the colors that can be used as background-color for the panel of the content-element.",
  "bgColorsCards": "Select the colors that can be used as background-color for the card.",
  "sideShadowColors": "Select the colors that can be used as left & right shadow-color for the content-element.",
  "hoverColors": "Select the colors that can be used as hover color for the content-element.",
  "layouts": "Define available layouts for the content-element.",
  "arrows": "Select the type of arrows that is used by the content-element.",
  "imgHeight": "",
  "showThumbnails": "",
  "showFullscreenButton": "",
  "showPlayButton": "",
  "fullScreenIconColor": "Defines the color for the full screen button.",
  "fullScreenIconFilterCss": "Adds CSS to the filter attribute of the full screen button.",
  "thumbnailHoverColor": "Adds a hover color for the full screen button.",
  "masonryColumnCount": "",
  "masonryMaxWidthPercent": "",
  "masonrySpaceBetween": "",
  "gridImageSize": "",
  "gridMaxWidthPercent": "",
  "gridSpaceBetween": "",
  "gridColumnCount": "",
  "captionContainerOffset": "Defines a space between caption container and carousel item edge",

  "colors": "Enables or disables the colors-palette for text in the richtext-editor. This has no impact on already created content.",

  "buttons": "Select the buttons that can be used by the content-manager.",
  "typographys": "Select the typographys that can be used by the content-manager.",
  "fonts": "Select (optional) fonts that can be used by the content-manager to style the typography.",
  "fontColors": "Select (optional) colors that can be used by the content-manager to style the typography.",
  "richtext": "Select a store configuration for this richtext.",
  "button": "Select a store configuration for this button.",

  "cesstrrichtext": "Select a contentElementSetting for the included richtext.",
  "cesstrbutton": "Select a contentElementSetting for the included button.",
  "cesstrheadline": "Select a contentElementSetting for the included headline.",

  "h1Typography": "Select the typography for the element.",
  "h2Typography": "Select the typography for the element.",
  "ctTypography": "Select the typography for the element.",
  "resultTypography": "Select the typography for the element.",
  "resultLink": "Select the link for the \"Go to content\"-Link of the result.",
  "cesstrrichtextFooter": "Select a contentElementSetting for the included richtext. The selected richtext stylings will apply to all HTML-elements in the footer.",
  "searchTermSpace": "Adds space (in pixel) underneath the search term.",
  "searchSummarySpace": "Adds space (in pixel) underneath the search summary.",
  "searchFilterSpace": "Adds space (in pixel) underneath the search filter."
}
